{
  "general-tips": {
    "id": "general-tips",
    "title": "General Tips & Settings",
    "subtitle": "Essential tips for getting started",
    "icon": "💡",
    "description": "Important settings and general advice for playing Pokémon Legends Z-A effectively.",
    "sections": [
      {
        "title": "Settings",
        "content": "Optimize your game settings for the best experience.",
        "bullets": [
          "Set text speed to fast for quicker reading",
          "Tweak camera sensitivity for your 'sweet spot'",
          "AUTOSAVE cannot be turned off! (First title in the series?)",
          "Feeling lost? Check the map and look for an exclamation point and press A to turn on navigation guidance",
          "When Shiny hunting, turn down the Music and Pokémon cries volume to hear the shiny sound better"
        ]
      },
      {
        "title": "Early Game Tips",
        "content": "Essential strategies for the beginning of your journey.",
        "bullets": [
          "Focus on the story missions to unlock key features quickly",
          "Resist the urge to start catching a bunch of Pokémon until you have seen your first Alpha, or you could have been catching Alphas and feel like you wasted your time",
          "Battle Pokémon nearby your walking path to gain experience and level up",
          "Quickly throw Pokéballs at wild Pokémon as you're walking",
          "After you unlock the ability to do a Rotom Phone jump between buildings, then you can start exploring more freely",
          "This ensures that you get the most of your exploration time, can access most everything, and possibly see Alphas and Mega Evolved Pokémon in the wild"
        ]
      },
      {
        "title": "Collectibles",
        "content": "Maximize your item resource gathering effectiveness throughout your playthrough.",
        "bullets": [
          "Collect Mega Shards (pink clusters) early on and throughout your playthrough by targeting with ZL and attacking with any attack",
          "Red Pokéballs and sparkles on the ground contain various random common items",
          "Glowing Yellow Pokéballs on the ground contain TMs",
          "Glowing Purple Pokéballs on the ground contain Colorful Screws (used for upgrading Plushes)",
          "Use Pokémon moves to clear obstacles and collect items",
          "Rock piles can be destroyed by Fighting moves (Rock is weak to Fighting); piles of Poison sludge can be cleared with Psychic moves, etc.",
          "Climb scaffolding and explore behind buildings to find the best items"
        ]
      },
      {
        "title": "Money Making",
        "content": "Best methods for earning money quickly.",
        "bullets": [
          "*This info is not confirmed yet*",
          "Sell duplicate items and materials",
          "Complete research tasks for monetary rewards",
          "Battle wealthy trainers in Lumiose City",
          "Participate in daily/weekly events",
          "Use Amulet Coin item to double battle earnings"
        ]
      },
      {
        "title": "Item Farming",
        "content": "Locations and methods for farming essential items.",
        "bullets": [
          "Evolution stones: Specific areas and wild Pokémon drops",
          "Berries: Plant and harvest at café locations",
          "Mints: Battle Tower rewards and special vendors",
          "Rare items: Complete research paths and side quests"
        ]
      },
      {
        "title": "Efficient Routes",
        "content": "Optimized paths for gathering materials.",
        "bullets": [
          "Create farming routes that hit multiple resource nodes",
          "Use flying mounts to quickly travel between areas",
          "Time-based spawns: Note what appears at different times",
          "Reset methods: Some items respawn daily or hourly",
          "Maximize inventory: Upgrade bag space early"
        ]
      },
      {
        "title": "Extra Tips",
        "content": "Additional helpful advice for your journey.",
        "bullets": [
          "Collect the Pokéballs with which you missed your target from an NPC outside Pokémon Centers"
        ]
      }
    ]
  },
  "battle-system": {
    "id": "battle-system",
    "title": "Battle System Guide",
    "subtitle": "Master the new real-time combat mechanics",
    "icon": "⚔️",
    "description": "Complete guide to Pokémon Legends Z-A's unique battle system, including controls, movement, and combat strategies.",
    "sections": [
      {
        "title": "Movement & Controls",
        "content": "Master the basic controls for combat.",
        "bullets": [
          "Lock on using ZL to see your moves and attack",
          "Use the joystick to move your character",
          "Hit Y to dodge attacks",
          "Use your 4 moves with the corresponding buttons (A, B, X, Y)"
        ]
      },
      {
        "title": "Party Management",
        "content": "Efficiently manage your Pokémon during battle.",
        "bullets": [
          "Use D-Pad left and right to cycle through your party",
          "Press up on the D-Pad to throw out the selected Pokémon right away",
          "Press down on the D-Pad to recall your Pokémon on the field",
          "Recalling comes at a cost: your next Pokémon has a cooldown",
          "When your current Pokémon faints, you have a second to pick your next one before it is automatically sent out"
        ]
      },
      {
        "title": "Pokémon Move Mechanics",
        "content": "Understand how moves work in real-time battles.",
        "bullets": [
          "All moves have cooldowns shown on their move icon",
          "Moves with less PP in other mainline games have longer cooldowns",
          "Status moves and stronger moves (like Hyperbeam) have longer cooldowns",
          "Check cooldown times on the move summary screen",
          "Ranged moves can be done from much farther away than melee moves",
          "Moves like Quick Attack happen very fast, giving the opponent little time to react",
          "Plan which moves to use in order, then adjust based on results",
          "Moves have an upgraded '+' variation unlocked by using them in battle",
          "When a Pokémon is Mega Evolved, all moves are automatically '+'"
        ]
      },
      {
        "title": "Advanced Techniques",
        "content": "Understand how moves work in real-time battles.",
        "bullets": [
          "Use the full arena and obstacles to your advantage",
          "Hit your opponent with a close range move, then quickly move away and use a ranged attack(example, could be mixed with status moves)",
          "You can easily set up status conditions and stat debuffs with one or two Pokémon, then switch to a sweeper to finish them off; this can be quicker and safer than waiting for moves to recharge"
        ]
      }
    ]
  },
  "training-evolution": {
    "id": "training-evolution",
    "title": "Training & Evolution",
    "subtitle": "Level up and evolve your Pokémon",
    "icon": "📈",
    "description": "Important information about how training and evolution work in Legends Z-A.",
    "sections": [
      {
        "title": "Training",
        "content": "Natures remain while Abilities are not present in Legends Z-A.",
        "bullets": [
          "Use Exp. Candy and Rare Candy to level up your Pokémon quickly",
          "Unlock the Red Canari Plush to gain extra Exp. Points by progressing the story",
          "You can see the effect of the nature with the red up arrow or blue down arrow on the stats summary screen (no arrows is a neutral Nature)"
        ]
      },
      {
        "title": "Learning Moves",
        "content": "Pokémon don't learn moves automatically in this game.",
        "bullets": [
          "Pokémon get the 'idea' for new moves by level up",
          "You must teach moves to them manually in the menu",
          "Plan your moveset strategically as you progress"
        ]
      },
      {
        "title": "Evolution",
        "content": "Evolution works differently in Legends Z-A.",
        "bullets": [
          "Pokémon do NOT evolve on their own",
          "You must evolve them manually in the menu",
          "No need for an Everstone to stop evolution",
          "Check evolution requirements (below) for any species with special conditions below"
        ]
      },
      {
        "title": "Special Evolution Requirements",
        "content": "Some Pokémon have unique evolution methods.",
        "bullets": [
          "Coming soon!"
        ]
      },
      {
        "title": "Trade Evolution Pokémon",
        "content": "These Pokémon require trading to evolve in Legends Z-A.",
        "bullets": [
          "Kadabra → Alakazam ",
          "Haunter → Gengar ",
          "Machoke → Machamp ",
          "Slowpoke → Slowking (trade while holding King's Rock)",
          "Onyx → Steelix (trade while holding Metal Coat)",
          "Scyther → Scizor (trade while holding Metal Coat)",
          "Spritzee → Aromatisse (trade while holding Sachet)",
          "Swirlix → Slurpuff (trade while holding Whipped Dream)",
          "Phantump → Trevenant ",
          "Pumpkaboo → Gourgeist "
        ]
      }
    ]
  },
  "competitive-training": {
    "id": "competitive-training",
    "title": "Competitive Training Guide",
    "subtitle": "Train your Pokémon's for competitive play",
    "icon": "🏆",
    "description": "These mechanisms are not needed for a casual player to enjoy the game, but are essential for competitive battling in Pokémon Legends Z-A.",
    "sections": [
      {
        "title": "Individual Values (IVs)",
        "content": "IV Training in Legends Z-A",
        "bullets": [
          "Although not directly trainable in Legends: Arceus, IVs and EVs are back to normal in Legends: Z-A",
          "IVs: Each Pokémon has hidden Individual Values that affect their stats (0-31 per stat)",
          "Use Bottle Caps to Hyper Train IVs at the Justice Dojo in Juane Sector 2",
          "Get Bottle Caps from high-level research rewards, 'Infinite Royale'(post-game) and Online Battle rewards"
        ]
      },
      {
        "title": "Nature",
        "content": "Natures in Legends Z-A",
        "bullets": [
          "Natures affect stat growth (e.g., Adamant increases Attack, decreases Special Attack)",
          "Obtain different Natures through breeding or catching Pokémon in the wild",
          "Change your Pokémon's Nature by purchasing and using Mints from the following locations:",
          "Rouge Sector Market(just west of Wild Zone 3): Adamant, Modest, Serious, Relaxed, Impish, Lonely, Naughty, Brave, Mild, Rash, Quiet, Bold, Impish, and Lax mints",
          "Johnny Plaza: Jolly, Adamant, and Modest mints(this will be updated more later!)",
          "Vert Sector(in between Wild Zone 11 and Restaurant Le Nah): Timid, Hasty, Jolly, Naive, and Serious mints",
          "Cost: Each mint costs 20,000 Pokédollars",
          "Availability: Vendors are accessible as early as Main Mission 5"
        ]
      },
      {
        "title": "Abilities",
        "content": "Abilities in Legends Z-A",
        "bullets": [
          "Abilities are not present in Legends Z-A (except for some Pokémon's special ability that is integral to their species, such as Doublade)"
        ]
      },
      {
        "title": "Effort Values (EVs)",
        "content": "These are semi-hidden stats that can be trained to boost your Pokémon's performance in battle",
        "bullets": [
          "These stats are trained boosted by battling Pokémon automatically, with different Pokémon species giving different EVs (see Active EV Training below)",
          "You can also increase them by using certain items (see Passive EV Training below)",
          "",
          "Buy EV reducing berries from street vendors next to the mint vendors (see Nature section below)",
          "Each berry reduces 10 EVs from a specific stat, allowing you to reallocate EVs as needed; it also increases friendship",
          "",
          "Pomeg Berry: Reduces HP EVs",
          "Kelpsy Berry: Reduces Attack EVs",
          "Qualot Berry: Reduces Defense EVs",
          "Hondew Berry: Reduces Special Attack EVs",
          "Grepa Berry: Reduces Special Defense EVs",
          "Tamato Berry: Reduces Speed EVs",
          "",
          "This is useful when you have a Pokémon that you've been battling with and now want to train for competitive purposes"
        ]
      },
      {
        "title": "EV Math",
        "content": "The important numbers behind EV training",
        "bullets": [
          "Each Pokemon can have a total of 510 EVs",
          "A maximum of 255 EVs in a single stat",
          "",
          "Each 4 EVs in a stat results in a +1 increase in that stat (at level 100)",
          "So any EV after a multiple of 4 is wasted (for example, 10 EVs in a stat only gives +2, while 12 EVs gives +3)",
          "252 EVs in a stat gives +63 at level 100 because 252 / 4 = 63 with no remainder",
          "So maxing a stat to 255 is wasting 3 EVs that could be used elsewhere",
          "",
          "The common practice is to max out 2 stats (252 EVs each) and put the remaining 6 EVs into a third stat",
          "This gives the most overall stat increases (63 + 63 + 1 = 127 total increase)",
          "An example would be a 'Physical Sweeper' with 252 Attack EVs, 252 Speed EVs, and 6 HP EVs (still 2 wasted EVs but it can't be helped)",
          "See more roles in the Team Building guide"
        ]
      },
      {
        "title": "Passive EV Training",
        "content": "Effort Values (EVs) in Legends Z-A (without battling - costs a lot of money)",
        "bullets": [
          "Use this method if you're short on time and have plenty of Pokédollars",
          "Buy EV-enhancing items (Vitamins) from any Poké Center in Lumiose City (after progressing past a certain point in the story; past Rank F)",
          "",
          "HP Up: Increases HP EVs by 10",
          "Protein: Increases Attack EVs by 10",
          "Iron: Increases Defense EVs by 10",
          "Calcium: Increases Special Attack EVs by 10",
          "Zinc: Increases Special Defense EVs by 10",
          "Carbos: Increases Speed EVs by 10"          
        ]
      },
      {
        "title": "Active EV Training",
        "content": "Effort Values (EVs) in Legends Z-A (while battling - costs time but chance of seeing shiny Pokémon)",
        "bullets": [
          "Use this method if you want to battle wild pokémon, short on Pokédollars, and/or want to gain Exp. Points (level up)",
          "You can catch the Pokémon after defeating them as well",
          "Each Pokémon species yields 1, 2, or 3 EVs in one stat when defeated (see list below) based on their most prominent stat",
          "Some Pokémon give EVs in multiple stats (for example, Heliolisk gives 1 Speed EV and 1 Special Attack EV) - using these Pokémon requires more planning but could potentially save time (probably not worth the planning time)",
          "",
          "Use Power items to gain even more specific EVs on top of the base EVs",
          "Buy Power items from any Poké Center (after reaching Rank A/Post-Game) - they can also be obtained from specific side missions",
          "",
          "Power Weight: +8 HP EVs per battle (Side mission 72)",
          "Power Bracer: +8 Attack EVs per battle (Side mission 38)",
          "Power Belt: +8 Defense EVs per battle (Side mission 39)",
          "Power Lens: +8 Special Attack EVs per battle (Side mission 104)",
          "Power Band: +8 Special Defense EVs per battle (Side mission 99)",
          "Power Anklet: +8 Speed EVs per battle (Side mission 69)"
        ]
      },
      {
        "title": "EV Training Route",
        "content": "I have hand-picked the best locations to farm EVs efficiently in Legends Z-A.",
        "bullets": [
          "For this strategy, put on the Power item for the corresponding stat and defeat all the Pokémon in the zone listed below, fast travel to that same location and repeat until you have maxed out the EVs for that stat (252 EVs total, which is 31.5 actual stat points)",
          "",
          "Low-level: These zones (1-10) will have the lowest level Pokémon that give the desired EVs, making it easier to defeat them quickly",
          "HP: Wild Zone 7 - Audino; Wild Zone 10 - Slowpoke",
          "Attack: Wild Zone 8 - All Pokémon here except for Numel; Wild Zone 10 - All Pokémon except for Slowpoke, Staryu, and Tynamo",
          "Defense: Wild Zone 7 - Hippowdon and Kakuna",
          "Special Attack: Wild Zone 6 - Houndour, Houndoom, and Flaaffy; Wild Zone 7 - Roselia and Vanillite",
          "Special Defense: Wild Zone 3 - Flabébé; Wild Zone 9 - Carbink; Wild Zone 6 - Swablu",
          "Speed: Wild Zone 1 - All Pokémon here except for Scatterbug and Mareep",
          "",
          "High-level: These zones (11-20) will have the highest level Pokémon that give the desired EVs, making it easier to level up while EV training",
          "HP: Wild Zone 12 - Snorunt and Gogoat",
          "Attack: Wild Zone 12 - Snover, Abomasnow, Machop, and Machoke; Wild Zone 13 - All Pokémon here except for Vivillon",
          "Defense: Wild Zone 14 - Onix, Aron, and Lairon",
          "Special Attack: Wild Zone 17 - Lampent (night) and Pyroar",
          "Special Defense: Wild Zone 6 - All Pokémon here give Special Defense EVs (except for Budew)",
          "Speed: Wild Zone 16 - Starmie and Medicham",
          "",
          "If you start with all of your Pokémon with 0 EV for that stat, you can check only one Pokémon's stat summary screen to see when you have maxed out the EVs for that stat (it will say 'Max EVs' under the stat)",
          "With a Power item, it takes 28 battles to max out a stat (if each Pokémon gives 1 EVs in that stat)"
        ]
      }
    ]
  },
  "plushes-charms": {
    "id": "plushes-charms",
    "title": "Plushes & Charms",
    "subtitle": "Boost your abilities with Canari Plushes",
    "icon": "🧸",
    "description": "Guide to collecting and upgrading Canari Plushes that replace traditional held items and provide various bonuses.",
    "sections": [
      {
        "title": "Canari Plush Types",
        "content": "Different colored plushes provide different bonuses.",
        "bullets": [
          "Red Canari Plush: Increases Exp. Points",
          "Gold Canari Plush: Increases prize money from battles",
          "Pink Canari Plush: Increases number of Mega Shards after smashing Mega Crystals",
          "Green Canari Plush: Makes you less likely to black out from taking damage",
          "Blue Canari Plush: More likely you'll succeed at catching Pokémon"
        ]
      },
      {
        "title": "Obtaining & Upgrading",
        "content": "How to get and improve your plushes.",
        "bullets": [
          "You'll get the Red Canari Plush while progressing the main story",
          "Trade colorful screws to the NPC outside Racine Construction in Vert Sector 7",
          "Plushes can be leveled from level 1 to level 3",
          "Each level costs 3 to 8 colorful screws",
          "Maxing all plushes requires 80 colorful screws total"
        ]
      },
      {
        "title": "Shiny Charm",
        "content": "Increases the chance of encountering shiny Pokémon.",
        "bullets": [
          "Shiny Charm is obtained through Mable's Research Level 50 Reward",
          "See the Pokédex section for more details on research tasks"
        ]
      }
    ]
  },
  "pokedex-research": {
    "id": "pokedex-research",
    "title": "Pokédex & Research",
    "subtitle": "Complete Mable's research tasks",
    "icon": "📚",
    "description": "Everything about the Pokédex research system and how to level it up for rewards.",
    "sections": [
      {
        "title": "Research System",
        "content": "How Mable's research tasks work",
        "bullets": [
          "Mable's research tasks level up your Pokédex from 1 to 50",
          "Level rewards include TMs, Exp. Candy, Bottle Caps",
          "Master Ball at level 49",
          "Shiny Charm at level 50",
          "Level 50 requires completing all research tasks including battle tasks (The points may work out slightly differently, but you must complete most tasks and it is not an easy task; Good luck)",
          "Check the tasks for specific requirements"
        ]
      },
      {
        "title": "Best Approach",
        "content": "Optimal strategy for completing research",
        "bullets": [
          "Catching a variety and large number of Pokémon throughout the playthrough is the way to go",
          "Focus on diverse species rather than just quantity",
          "Complete species-specific tasks as you encounter them"
        ]
      },
      {
        "title": "Pokédex Completion",
        "content": "Fill your Pokédex fast for the quickest way to level up",
        "bullets": [
          "Explore every corner of each Wild Zone during the day and night",
          "Use the map to track how many species remain to be caught in each zone",
          "Trade with people online for missing species (you should catch extra of each species you find, especially rare spawns)",
          "Use Pokémon HOME to transfer over any Pokémon you have from other games that are in Legends Z-A"
        ]
      }
    ]
  },
  "wild-pokemon": {
    "id": "wild-pokemon",
    "title": "Wild Pokémon Guide",
    "subtitle": "Catch Pokémon effectively in the wild",
    "icon": "🌿",
    "description": "Master the art of catching wild Pokémon with stealth mechanics, battle strategies, and catch rate optimization.",
    "sections": [
      {
        "title": "Spawning",
        "content": "How spawning works for wild Pokémon.",
        "bullets": [
          "Pokémon will despawn if you leave their area",
          "Pokémon respawn after a certain amount of time",
          "Some Pokémon spawn in specific zones or at certain times of day",
          "Some Pokémon will disappear if you get too close without stealth",
          "Shiny Pokémon don't despawn until caught or defeated"
        ]
      },
      {
        "title": "States",
        "content": "The 4 states of wild Pokémon and how they behave",
        "bullets": [
          "1. Unaware: Pokémon are not actively searching for you and has not noticed you yet",
          "2. Aware: Pokémon have noticed you and are investigating",
          "The next state depends on the species' behavior type",
          "3. Timid: Pokémon runs away and despawns within 5 seconds",
          "3. Curious: Pokémon stare at you",
          "3. Indifferent: Pokémon ignore you",
          "3. Battle/Aggro: Pokémon are actively trying to attack you",
          "4. Angry: Pokémon are actively attacking you and will not be able to be caught with Poké Balls until calmed down by running out of sight or attacking them"
        ]
      },
      {
        "title": "Stealth Catching",
        "content": "Use stealth to your advantage when catching wild Pokémon",
        "bullets": [
          "Lock on to wild Pokémon using ZL",
          "Crouch and use bushes to stay hidden",
          "Wild Pokémon can be caught without battling by throwing a Poké Ball at them",
          "Strike them in the back for an improved chance of success",
          "If they don't stay in the ball, they may become angry and require battling",
          "The red X indicates the Pokémon is angry - Poké Balls won't work until you battle it",
          "The red eye just indicates they are targeting you but you still may be able to throw a Poké Ball",
          "Angry Pokémon will calm down if you run out of their sight for a moment"
        ]
      },
      {
        "title": "Battle Catching",
        "content": "Strategies for catching Pokémon during battles",
        "bullets": [
          "Throw your Pokémon (in its Poké Ball) at a wild Pokémon to initiate battle",
          "You can throw a Poké Ball at any point during battle to try to catch it",
          "Low level Pokémon under level 10 can often be caught without damage",
          "Dealing damage and/or inflicting status conditions increases catch chances",
          "When you knock a Pokémon to 0 HP, there's a small window for an increased catch while it is dazed, indicated by the stars are spinning",
          "Certain balls have higher catch rates or work better in specific circumstances"
        ]
      },
      {
        "title": "Important Warnings",
        "content": "Be careful when catching rare or shiny Pokémon",
        "bullets": [
          "Be CAREFUL when battling a Pokémon you intend to catch (especially Shinies)",
          "Don't knock it out accidentally by using moves that are too strong",
          "Watch for recoil moves in the Pokémon's movepool",
          "If they use a move like Self-Destruct, throw better Poké Balls early to avoid it",
          "The dazed state the Pokémon enters when knocked out is a saving grace for these situations, be ready to throw a Poké Ball"
        ]
      }
    ]
  },
  "shiny-hunting": {
    "id": "shiny-hunting",
    "title": "Shiny Hunting Guide",
    "subtitle": "Master the art of finding shiny Pokémon in Legends Z-A",
    "icon": "✨",
    "description": "Complete guide to shiny hunting in Pokémon Legends Z-A, including identification, methods, and tips for finding rare shiny Pokémon.",
    "sections": [
      {
        "title": "Shiny Odds & Mechanics",
        "content": "Base shiny odds in Legends Z-A are 1/4096. However, various methods can significantly increase your chances.",
        "bullets": [
          "Base odds: 1/4096 (same as recent mainline games)",
          "Shiny Charm: Increases odds to approximately 1/1024.38",
          "Defeating all Pokémon in a wild zone and waiting for the next wave may increase shiny chance (my hypothesis - needs confirmation)",
          "Since this game will not despawn your Shiny, the more you walk around and spawn in new Pokémon, the better your chances",
          "Resetting zones by going in and out of a stairway resets all spawns nearby"
        ]
      },
      {
        "title": "Identifying Shinies",
        "content": "How to recognize when you've encountered a shiny Pokémon.",
        "bullets": [
          "Shinies appear shiny in the overworld before battle",
          "Stars appear and a pleasant sound plays when a Shiny spawns",
          "Look and listen for these visual and audio cues while exploring",
          "Shiny Pokémon don't despawn until caught, defeated, you run away after starting a battle, or it runs away due to it's species behaviors",
          "Up to 10 shiny Pokémon can exist in the world at once",
          "Save when you see a shiny in case something goes wrong and during the battle if things start to go south",
          "If you knock the Pokémon out, and you throw a ball while it is stunned and it breaks out, soft reset (close the game and restart) to try again",
          "Check you have balls, healed Pokémon, and healing items before engaging"
        ]
      },
      {
        "title": "Shiny Hunting Methods",
        "content": "Techniques to increase your chances of finding shinies.",
        "bullets": [
          "Defeat all Pokémon in a wild zone, then wait for the next wave to respawn",
          "This may increase your shiny chance (hypothesis - needs confirmation)",
          "Use the Shiny Charm obtained at Research Level 50 for better odds",
          "Check Wild Zones at different times of day for different spawns",
          "No breeding or so therefore no \"Masuda Method\" in this game",
          "Shiny Charm does not effect fossils, but they can be shiny"
        ]
      },
      {
        "title": "Catching Shiny Pokémon",
        "content": "Special precautions when catching shinies.",
        "bullets": [
          "Be extremely careful not to knock out the shiny",
          "Consider using stealth and not battling if possible",
          "Use weaker moves to chip away HP safely",
          "Avoid using very strong attacks that might KO in one hit",
          "Watch for the Pokémon using Self-Destruct or recoil moves",
          "Consider using status moves like Sleep or Paralysis",
          "Throw high-quality Poké Balls early if concerned about fainting"
        ]
      },
      {
        "title": "Shiny Locked Pokémon",
        "content": "These Pokémon cannot be shiny.",
        "bullets": [
          "Your starters",
          "Kanto Starter gift",
          "All gift Pokémon",
          "Trades with NPCs",
          "Rogue Mega Absol in storyline",
          "Kalos Starter Mission rewards",
          "The fossil Pokémon restored in the storyline",
          "Static Pokemon in the storyline (like Alphas and Legendaries)"
        ]
      }
    ]
  },
  "wild-zones": {
    "id": "wild-zones",
    "title": "Wild Zones Guide",
    "subtitle": "Navigate and explore Wild Zones effectively",
    "icon": "🗺️",
    "description": "Information about Wild Zones, their mechanics, and what to expect when exploring them.",
    "sections": [
      {
        "title": "Wild Zone Basics",
        "content": "Understanding how Wild Zones work.",
        "bullets": [
          "Have a level cap on the wild Pokémon that spawn there",
          "A recommended level appears on the door when you walk up to it",
          "Some Pokémon spawn in certain zones or during certain times",
          "Use benches to change the time of day",
          "Look around thoroughly - some Pokémon are small or hiding or only spawn on rooftops (find ladders)",
          "No Pokémon Centers inside Wild Zones"
        ]
      },
      {
        "title": "Exploration Tips",
        "content": "Make the most of your Wild Zone visits.",
        "bullets": [
          "Check the recommended level before entering",
          "Bring healing items since there are no centers inside",
          "Explore thoroughly to find hidden Pokémon",
          "Return at different times of day for different spawns",
          "Wild Zones are active during the day and night"
        ]
      }
    ]
  },
  "z-a-royale": {
    "id": "z-a-royale",
    "title": "Z-A Royale Guide",
    "subtitle": "Compete in the battle royale mode",
    "icon": "👑",
    "description": "Complete guide to Z-A Royale mode, including mechanics, progression, and rewards.",
    "sections": [
      {
        "title": "Royale Basics",
        "content": "How Z-A Royale works.",
        "bullets": [
          "Only takes place at night",
          "Your rival will be there to heal your Pokémon near the entrance",
          "Has a built-in fast travel system",
          "Earn points and medals by defeating trainers",
          "Ascend ranks from Z to A by earning points",
          "Each rank requires more points than the last"
        ]
      },
      {
        "title": "Bonus Cards",
        "content": "Use Bonus Cards to unlock special research tasks.",
        "bullets": [
          "Collect Bonus Cards to unlock specific research tasks",
          "Research tasks give additional points and medals",
          "You can carry up to 3 Bonus Cards at a time",
          "Swap out one Bonus Card for a different one you find",
          "Bonus Cards do NOT carry over after the Royale ends",
          "Complete a card to pick up another and start working on it"
        ]
      },
      {
        "title": "Rewards",
        "content": "What you can earn in Z-A Royale",
        "bullets": [
          "Prize Medals can be found on the ground during matches",
          "You are rewarded Poké Dollars at the end of the match",
          "Higher ranks provide better rewards",
          "Focus on completing Bonus Cards for maximum points"
        ]
      },
      {
        "title": "Advanced Techniques",
        "content": "Tips for excelling in Z-A Royale",
        "bullets": [
          "Utilize the environment: Use obstacles for cover",
          "Be quick and decisive with your actions",
          "Heal between trainers",
          "Swap to a good type matchup before engaging",
          "Use stealth to sneak up on opponents, target their Pokémon, and attack for a chance to leave them stunned at the beginning of battle (you must act fast to capitalize on this)",
          "Keep an eye on the timer: Matches are time-limited",
          "Focus on completing Bonus Cards for maximum points"
        ]
      }
    ]
  },
  "day-night-cycle": {
    "id": "day-night-cycle",
    "title": "Day/Night Cycle",
    "subtitle": "Control time to access different content",
    "icon": "🌓",
    "description": "How the day/night cycle works and how to change it to access time-exclusive content.",
    "sections": [
      {
        "title": "Changing Time",
        "content": "How to switch between day and night.",
        "bullets": [
          "Change time by sitting on a bench",
          "There is a bench next to each Pokémon Center and inside each Wild Zone",
          "Use this to access time-exclusive content",
          "Although sometimes changed to suit the story's needs, the day lasts roughly 10 minutes in real time, and the night lasts about 10 minutes as well (need to test to confirm specific times)"
        ]
      },
      {
        "title": "Time-Exclusive Content",
        "content": "What's available at different times.",
        "bullets": [
          "Battle Royale is only available at night",
          "Wild Zones are active during the day and night",
          "Some Pokémon only spawn at certain times",
          "Plan your activities around the time of day"
        ]
      }
    ]
  },
  "competitive-ranking": {
    "id": "competitive-ranking",
    "title": "Competitive Ranking Guide",
    "subtitle": "Climb the ranked ladder efficiently",
    "icon": "🏆",
    "description": "Strategies and tips for climbing the competitive ranks in Pokémon Legends Z-A, including team building and meta analysis.",
    "sections": [
      {
        "title": "Core Gameplay Mechanics",
        "content": "All out battle with 4 trainers in a free-for-all format",
        "bullets": [
          "You must bring EXACTLY 3 Pokémon in your party to battle",
          "You and 3 other trainers battle for three minutes",
          "Each Knockout grants you one point",
          "You are able to swap Pokémon 3 times; choose wisely (keep an eye on health and swap when health is low or type mismatch)",
          "Any time your current Pokémon faints, you are reset after a 5 second cooldown",
          "Use the space to your advantage: obstacles can block line of sight and give you cover"
        ]
      },
      {
        "title": "Understanding the Ranked System",
        "content": "Learn how the ranking system works and what it takes to climb.",
        "bullets": [
          "Ranked tiers: From Z to A",
          "Events: Special rewards given out for reaching rank K (as of right now) each season!",
          "Progress: Progress or regress based on match point outcomes",
          "Seasonal resets: Rankings reset periodically with rewards",
          "Matchmaking: Based on current rank and win rate"
        ]
      },
      {
        "title": "Meta Team Building",
        "content": "Build competitive teams that can handle the current meta.",
        "bullets": [
          "Core roles: Sweeper, Tank, Support balanced composition",
          "Type coverage: Ensure team covers major threats",
          "Speed tiers: Understand which Pokémon outspeed others",
          "Synergy: Moves and types that complement each other",
          "Adapt to meta shifts: Stay updated on popular strategies"
        ]
      },
      {
        "title": "Climbing Strategies",
        "content": "Practical tips for efficient rank progression.",
        "bullets": [
          "Master 2-3 teams instead of constantly switching",
          "Study replays: Learn from losses and refine strategy",
          "Time your sessions: Play when you're focused and alert",
          "Track your record: Identify which teams/strategies work best",
          "Take breaks: Avoid tilt and maintain peak performance"
        ]
      },
      {
        "title": "Advanced Techniques",
        "content": "In-depth strategies for experienced players.",
        "bullets": [
          "Mind games: Predict opponent moves and adapt",
          "Baiting: Use certain Pokémon to lure out threats",
          "Setup: Use status moves and buffs to gain advantage (can be done with First Pokemon and then switch to a Sweeper)",
          "Stay aware: Avoid getting caught off-guard by multiple opponents",
          "See more in the team-building section"
        ]
      }
    ]
  },
  "team-building": {
    "id": "team-building",
    "title": "Team Building Guide",
    "subtitle": "Create balanced and effective teams",
    "icon": "👥",
    "description": "Comprehensive guide to building effective Pokémon teams in Legends Z-A, covering roles, synergies, and optimal compositions.",
    "sections": [
      {
        "title": "Team Roles & Composition",
        "content": "Every successful team needs balance between different roles.",
        "bullets": [
          "Physical Sweeper: High attack, focuses on physical moves",
          "Special Sweeper: High special attack for special moves",
          "Tank/Wall: High defenses to absorb damage",
          "Support: Healing, buffs, status effects",
          "Pivot: Flexible role that adapts to situations",
          "Recommended: one of each role for a balanced team (3 Pokémon means some roles may be combined)"
        ]
      },
      {
        "title": "Type Coverage",
        "content": "Ensure your team can handle all threats effectively.",
        "bullets": [
          "Cover each other's weaknesses: No shared vulnerabilities",
          "Offensive coverage: Hit most types for super-effective damage",
          "Defensive synergy: Resist common attacking types",
          "Priority moves: Have at least one Pokémon with priority",
          "Weather/terrain: Consider weather team strategies (may not be in this game)",
          "Non-STAB moves: Teach your Pokémon coverage moves to handle type disadvantages ; An example is Ice Beam on a Water type which would give it a SuperEffective move against Grass-types, it's normal weakness"
        ]
      },
      {
        "title": "Movesets & Abilities",
        "content": "Optimize individual Pokémon for their roles.",
        "bullets": [
          "STAB moves: Same Type Attack Bonus for reliable damage",
          "Coverage moves: Handle type disadvantages",
          "Status moves: One utility move per Pokémon minimum",
          "Ability synergy: Abilities that support team strategy",
          "Held items: Choose items that enhance role effectiveness or berries that heal a status that this Pokémon is likely to suffer from"
        ]
      }
    ]
  },
  "alpha-pokemon": {
    "id": "alpha-pokemon",
    "title": "Alpha Pokémon Guide",
    "subtitle": "Find and catch powerful Alpha Pokémon",
    "icon": "⭐",
    "description": "*This information needs to be verified* Everything you need to know about Alpha Pokémon in Legends Z-A, including locations, catching strategies, and benefits.",
    "sections": [
      {
        "title": "What Are Alpha Pokémon?",
        "content": "Alpha Pokémon are larger, stronger variants with special properties.",
        "bullets": [
          "Significantly larger than normal Pokémon (the largest that species can be)",
          "Higher stats and better starting moves",
          "Glowing red eyes and aggressive behavior",
          "Automatically come with max Effort Values (EVs) for Health stat",
          "Automatically come with max Individual Values (IVs) for three random stats",
          "Rare spawns in specific locations"
        ]
      },
      {
        "title": "Finding Alpha Pokémon",
        "content": "Locations and spawn conditions for Alpha encounters.",
        "bullets": [
          "Fixed spawn locations: Same Alphas appear in set locations",
          "Random spawns: Some areas have rotating Alpha spawns",
          "Weather conditions: Certain Alphas only appear in specific weather",
          "Time of day: Some Alphas are time-exclusive",
          "Check the map tab for confirmed Alpha locations"
        ]
      },
      {
        "title": "Catching Strategies",
        "content": "Tips for successfully catching Alpha Pokémon.",
        "bullets": [
          "Use Heavy Balls*might not be in this game* for better catch rates on large Pokémon",
          "Approach from behind for easier first throws",
          "Lower HP significantly before attempting capture",
          "Status effects greatly improve catch rates",
          "Save before attempting rare Alpha encounters",
          "Consider battling to weaken instead of stealth catching"
        ]
      }
    ]
  }
}
